sk/modules/admin/controllers/RepairsController.php

SELECT * FROM `repairs` ORDER BY `id` DESC LIMIT 1
---
    public function actionIndex()
    {
        $searchModel = new RepairsSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $result = Repairs::find()->orderBy('id DESC')->limit(1)->one();

SELECT * FROM `complete` WHERE `repairs_id`='2'
SELECT * FROM `material` WHERE `repairs_id`='2'
---
    public function actionView($id)
    {
        $complete = Complete::find()->andWhere(['repairs_id'=>$id]);
        $dataProvider = new ActiveDataProvider([
            'query' =>$complete,
        ]);
        $complete=$complete->all();

        $material = Material::find()->andWhere(['repairs_id'=>$id]);
        $dataProviderMaterial = new ActiveDataProvider([
            'query' =>$material,
        ]);
        $material=$material->all();

SELECT * FROM `repairs` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Repairs::findOne($id)) !== null) {