sk/config/web.php

SELECT * FROM `auth_assignment` WHERE `user_id`=3 LIMIT 1
SELECT * FROM `auth_item` WHERE `name`='admin' LIMIT 1
---
    ],
    'on beforeAction' => function(){
        if(!Yii::$app->user->isGuest){
            $roles = (new \yii\db\Query())->from('auth_assignment')->where(['user_id'=>Yii::$app->user->identity->id])->limit(1)->one();
            $roles = (new \yii\db\Query())->from('auth_item')->where(['name'=>$roles['item_name']])->limit(1)->one();