sk/controllers/ClientsController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Clients::find(),
        ]);
        $models=Clients::find()->all();
---
SELECT * FROM `clients`