sk/controllers/SiteController.php

    public function actionIndex()
    {
        $master=Master::find()->count();
        $repairs=Repairs::find()->count();
        $sertificat=Sertificat::find()->count();
        $services=Services::find()->count();
        $clients=Clients::find()->all();
---
SELECT COUNT(*) FROM `master`
SELECT COUNT(*) FROM `repairs`
SELECT COUNT(*) FROM `sertificat`
SELECT COUNT(*) FROM `services`
SELECT * FROM `clients`

    public function actionSertificat()
    {
        $models=Sertificat::find()->all();
---
SELECT * FROM `sertificat`