<?
include("include/bd.php");
//include ("include/auth.php"); 
?>


<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Карагандинская академия МВД РК имени Б.Бейсенова</title>
<meta name="description" content="Education website">
<meta name="keywords" content="education, learning, teaching">
</head>

<body>

<table align=center>
<tr>

<td align=center>Қазақстан Республикасы Ішкі істер министрлігінің<br>
әскери, арнаулы оқу орындарында білім<br>
алушылардың үлгеріміне ағымдағы бақылау, оларға<br>
аралық және қорытынды аттестаттау жүргізу<br>
қағидаларына<br>
4-қосымша<br></td>
<td width=200><td>
<td align=center>Приложение 4<br>
к Правилам проведения<br>
текущего контроля успеваемости,<br>
промежуточной и итоговой аттестации<br>
обучающихся военных, специальных<br>
учебных заведений Министерства<br>
внутренних дел Республики Казахстан</td>
</tr></table>

<p align=center>ҚОРЫТЫНДЫ БАҚЫЛАУ ВЕДОМОСІ / ВЕДОМОСТЬ ИТОГОВОГО КОНТРОЛЯ</p>

<table>
<tr><td>Факультет (институт)_________ ______ __________________ оқу тобы</td><td>Факультет (институт) ________________</td></tr>
<tr><td>Мамандығы: "____________________" " _________ " оқу тобы</td><td>_____________________________________</td></tr>
<tr><td>Пән: ____________________________ " _________ "</td><td>Специальность:</td></tr>
<tr><td>Кредиттің саны: _____________ __________________________________</td><td>"___________________________________"</td></tr>
<tr><td>Емтиханды өткізу мерзімі</td><td> Дисциплина: _________________________</td></tr>
<tr><td>__________________________________</td><td>Количество кредитов: ________________	____ семестр ________________</td></tr>
<tr><td>Оқытушының тегі, аты, әкесінің аты</td><td>учебный год _________________<br></td></tr>
<tr><td>(бар болған жағдайда)</td><td>учебная группа ______________<br></td></tr>
</table>









"______" _____________________<br>
 Дата проведения экзамена ______________________________<br>
фамилия имя отчество (при его наличии) преподавателя


</body>
</html>
