api/controllers/RestController.php

    public function actionLogin()
    {

        $auth = Expert::find()->select('id')
        ->andWhere(['and',
            ['pass'=>Yii::$app->request->post('pass')],
            ['login'=>Yii::$app->request->post('login')],
            ['activ'=>1],
        ])->limit(1)->one();
        $t=1;
       if($auth==null){
            $auth = Moderator::find()->select('id')
                ->andWhere(['and',['pass'=>Yii::$app->request->post('pass')],['login'=>Yii::$app->request->post('login')]])->limit(1)->one();
---
SELECT `id` FROM `expert` WHERE (`pass`='2134') AND (`login`='1242') AND (`activ`=1) LIMIT 1
SELECT `id` FROM `moderator` WHERE (`pass`='2134') AND (`login`='1242') LIMIT 1