sk/modules/admin/views/auth/index.php

SELECT COUNT(*) FROM `user` WHERE status=10
SELECT COUNT(*) FROM `user` WHERE status=0
---

$this->title = 'Пользователи';
$this->params['breadcrumbs'][] = $this->title;
$on = User::find()->where('status=10')->count();
$off = User::find()->where('status=0')->count();