{
"bot": {
"0": {
"content": [
"Привет!",
"Я SK - бот поддержки сайта <a href=\"https://sk\" target=\"_blank\">sk</a>"
],
"human": [0, 1, 2]
},
"1": { "content": "Я тоже рад, как мне к Вам обращаться?", "human": [3] },
"2": { "content": "Как мне к Вам обращаться?", "human": [3] },
"3": { "content": "{{name}}, что Вас интересует?", "human": [4, 5,12] },
"4": {
"content": "{{name}}, наш сервис-центр находится в городе Караганда (Казахстан) на проспекте Н. Абдирова 47/1.",
"human": [6]
},
"5": { "content": "{{name}}, наши контакты: <ul><li>87059102200</li><li>Sk@Statuskrg.Kz</li><li>Statuskaraganda@Gmail.Com</li></ul>", "human": [11] },
"6": {
"content": "{{name}}, мы получили Ваш вопрос! Скажите, как с Вами удобнее будет связаться?",
"human": [8, 9]
},
"7": { "content": "{{name}}, укажите пожалуйста ваш телефон", "human": [10] },
"8": { "content": "{{name}}, укажите пожалуйста ваш Email ниже", "human": [10] },
"9": {
"content": "Готово! {{name}}, мы свяжемся с вами в ближайшее время по {{contact}}. Всего хорошего!",
"human": [6]
},
"10": { "content": "{{name}}, какой у Вас вопрос?", "human": [7] }
},
"human": {
"0": { "content": "Привет! Я рад с тобой познакомиться", "bot": 1 },
"1": { "content": "Салют!", "bot": 2 },
"2": { "content": "Приветик, SK!", "bot": 2 },
"3": { "content": "", "bot": 3, "name": "name" },
"4": {
"content": "Меня интересует, как я могу найти ваш сервис-центр.",
"bot": 4
},
"5": { "content": "Как я могу связаться с вами?", "bot": 5 },
"6": { "content": "В начало", "bot": 3 },
"7": { "content": "", "bot": 6, "name": "" },
"8": { "content": "по телефону", "bot": 7 },
"9": { "content": "по email", "bot": 8 },
"10": { "content": "", "bot": 9, "name": "contact" },
"11": { "content": "У вас есть еще вопросы?", "bot": 3 },
"12": { "content": "Хочу задать вопрос.", "bot": 10 }
}
}
